---
kind: other
id: Methods.T:Autodesk.Revit.DB.FootPrintRoof
source: html/b7382d7d-f80b-c9df-2e28-eb767405c240.htm
---
# FootPrintRoof Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.